### Shared environment
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azuread_application_published_app_ids.well_known: Reading...
azuread_application_registration.web: Refreshing state... [id=/applications/4dc1ecb4-fb24-4419-bc8c-64b15338b47e]
azuread_application_registration.api: Refreshing state... [id=/applications/148fcf27-f238-4b56-bf22-af0906b3f070]
data.azuread_application_published_app_ids.well_known: Read complete after 0s [id=appIds]
data.azuread_service_principal.msgraph: Reading...
azuread_application_redirect_uris.web: Refreshing state... [id=/applications/4dc1ecb4-fb24-4419-bc8c-64b15338b47e/redirectUris/SPA]
azuread_service_principal.web: Refreshing state... [id=/servicePrincipals/febd01e6-38ac-48b4-ad27-8dcb216ea6b6]
azuread_service_principal.api: Refreshing state... [id=/servicePrincipals/7f571a01-5c51-42f8-aefd-040416f5845a]
data.azuread_service_principal.msgraph: Read complete after 2s [id=/servicePrincipals/cb86be44-f8dd-45b1-a3cd-70f5a88e8b96]
azuread_application_api_access.api: Refreshing state... [id=/applications/148fcf27-f238-4b56-bf22-af0906b3f070/apiAccess/00000003-0000-0000-c000-000000000000]
azuread_application_api_access.web_graph: Refreshing state... [id=/applications/4dc1ecb4-fb24-4419-bc8c-64b15338b47e/apiAccess/00000003-0000-0000-c000-000000000000]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD01MWNmMDJmYi00Mjc3LTQ3NWQtOGYxNC05MTg3ZjY4YTI4NzM7b2JqZWN0SWQ9NDQzM2MyOWEtMDE0NS00ZjI4LTkzY2YtMTZiY2RkMzhiZmViO3N1YnNjcmlwdGlvbklkPTE2ZTAxYTAwLWY4MjUtNGM5Ni04YWUyLWU2OGNiNTJjZjY1Mzt0ZW5hbnRJZD1mZmFiMzhkZi1jZGRmLTQzM2YtODU5YS02Y2ZhMTYxYTVjZWI=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azuread_application_api_access.web_api will be created
  + resource "azuread_application_api_access" "web_api" {
      + api_client_id  = "757b49c8-3305-4d85-b3cd-cddae1f615cf"
      + application_id = "/applications/4dc1ecb4-fb24-4419-bc8c-64b15338b47e"
      + id             = (known after apply)
      + scope_ids      = (known after apply)
    }

  # azuread_application_identifier_uri.api will be created
  + resource "azuread_application_identifier_uri" "api" {
      + application_id = "/applications/148fcf27-f238-4b56-bf22-af0906b3f070"
      + id             = (known after apply)
      + identifier_uri = "api://757b49c8-3305-4d85-b3cd-cddae1f615cf"
    }

  # azuread_application_permission_scope.api_access_as_user will be created
  + resource "azuread_application_permission_scope" "api_access_as_user" {
      + admin_consent_description  = "This allows a user to access the API."
      + admin_consent_display_name = "Access API as user"
      + application_id             = "/applications/148fcf27-f238-4b56-bf22-af0906b3f070"
      + id                         = (known after apply)
      + scope_id                   = (known after apply)
      + type                       = "User"
      + user_consent_description   = "This allows you to access the API."
      + user_consent_display_name  = "Access API as user"
      + value                      = "access_as_user"
    }

  # azuread_application_registration.api will be updated in-place
  ~ resource "azuread_application_registration" "api" {
      + description                            = "Used to authenticate to the TShort API"
        id                                     = "/applications/148fcf27-f238-4b56-bf22-af0906b3f070"
      ~ requested_access_token_version         = 0 -> 2
        # (17 unchanged attributes hidden)
    }

  # azuread_application_registration.web will be updated in-place
  ~ resource "azuread_application_registration" "web" {
      + description                            = "Used to administer the TShort service."
        id                                     = "/applications/4dc1ecb4-fb24-4419-bc8c-64b15338b47e"
      ~ requested_access_token_version         = 0 -> 2
        # (17 unchanged attributes hidden)
    }

  # azurerm_container_registry.main will be created
  + resource "azurerm_container_registry" "main" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "westeurope"
      + login_server                  = (known after apply)
      + name                          = "crtshortwesteurope001"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-tshort-shared-westeurope-001"
      + sku                           = "Basic"
      + tags                          = {
          + "environment" = "Shared"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
      + trust_policy_enabled          = false
      + zone_redundancy_enabled       = false
    }

  # azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "rg-tshort-shared-westeurope-001"
      + tags     = {
          + "environment" = "Shared"
          + "managed-by"  = "Terraform"
          + "project"     = "TShort"
        }
    }

  # azurerm_role_assignment.acr_push will be created
  + resource "azurerm_role_assignment" "acr_push" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4433c29a-0145-4f28-93cf-16bcdd38bfeb"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # random_uuid.api_access_as_user will be created
  + resource "random_uuid" "api_access_as_user" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 7 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + registry_name = "crtshortwesteurope001"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>